using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace ShomreiTorah.Common.Calendar {
	public partial class HebrewDayInfo {
		///<summary>Gets the day of the עומר for this morning (between 1 and 49), or -1 if this date is not during ספריה.</summary>
		public int OmerDay {
			get {
				//Subtracting from the first day gives me a number between 1 & 49, as opposed to 0 - 48
				var retVal = (Date - Holidays.Holiday.פסח[1].Date.GetDate(Date.HebrewYear)).Days;
				if (retVal < 1 || retVal > 49)
					return -1;
				else
					return retVal;
			}
		}
		///<summary>Gets the text for ספירת העומר for this morning without נקודות, or null if this date is not during ספריה.</summary>
		public string OmerText { get { return OmerDay == -1 ? null : omerסתם[OmerDay - 1]; } }
		///<summary>Gets the text for ספירת העומר for this morning with נקודות, or null if this date is not during ספריה.</summary>
		public string OmerTextנקוד { get { return OmerDay == -1 ? null : omerנקוד[OmerDay - 1]; } }

		#region Strings
		//Source: my OmerChart.doc
		static readonly string[] omerסתם = new[]{
			"היום יום אחד לעומר",
			"היום שני ימים לעומר",
			"היום שלשה ימים לעומר",
			"היום ארבעה ימים לעומר",
			"היום חמשה ימים לעומר",
			"היום ששה ימים לעומר",
			"היום שבעה ימים שהם שבוע אחד לעומר",
			"היום שמונה ימים שהם שבוע אחד ויום אחד לעומר",
			"היום תשעה ימים שהם שבוע אחד ושני ימים לעומר",
			"היום עשרה ימים שהם שבוע אחד ושלשה ימים לעומר",
			"היום אחד עשר יום שהם שבוע אחד וארבעה ימים לעומר",
			"היום שנים עשר יום שהם שבוע אחד וחמשה ימים לעומר",
			"היום שלשה עשר יום שהם שבוע אחד וששה ימים לעומר",
			"היום ארבעה עשר יום שהם שני שבועות לעומר",
			"היום חמשה עשר יום שהם שני שבועות ויום אחד לעומר",
			"היום ששה עשר יום שהם שני שבועות ושני ימים לעומר",
			"היום שבעה עשר יום שהם שני שבועות ושלשה ימים לעומר",
			"היום שמונה עשר יום שהם שני שבועות וארבעה ימים לעומר",
			"היום תשעה עשר יום שהם שני שבועות וחמשה ימים לעומר",
			"היום עשרים יום שהם שני שבועות וששה ימים לעומר",
			"היום אחד ועשרים יום שהם שלשה שבועות לעומר",
			"היום שנים ועשרים יום שהם שלשה שבועות ויום אחד לעומר",
			"היום שלשה ועשרים יום שהם שלשה שבועות ושני ימים לעומר",
			"היום ארבעה ועשרים יום שהם שלשה שבועות ושלשה ימים לעומר",
			"היום חמשה ועשרים יום שהם שלשה שבועות וארבעה ימים לעומר",
			"היום ששה ועשרים יום שהם שלשה שבועות וחמשה ימים לעומר",
			"היום שבעה ועשרים יום שהם שלשה שבועות וששה ימים לעומר",
			"היום שמונה ועשרים יום שהם ארבעה שבועות לעומר",
			"היום תשעה ועשרים יום שהם ארבעה שבועות ויום אחד לעומר",
			"היום שלשים יום שהם ארבעה שבועות ושני ימים לעומר",
			"היום אחד ושלשים יום שהם ארבעה שבועות ושלשה ימים לעומר",
			"היום שנים ושלשים יום שהם ארבעה שבועות וארבעה ימים לעומר",
			"היום שלשה ושלשים יום שהם ארבעה שבועות וחמשה ימים לעומר",
			"היום ארבעה ושלשים יום שהם ארבעה שבועות וששה ימים לעומר",
			"היום חמשה ושלשים יום שהם חמשה שבועות לעומר",
			"היום ששה ושלשים יום שהם חמשה שבועות ויום אחד לעומר",
			"היום שבעה ושלשים יום שהם חמשה שבועות ושני ימים לעומר",
			"היום שמונה ושלשים יום שהם חמשה שבועות ושלשה ימים לעומר",
			"היום תשעה ושלשים יום שהם חמשה שבועות וארבעה ימים לעומר",
			"היום ארבעים יום שהם חמשה שבועות וחמשה ימים לעומר",
			"היום אחד וארבעים יום שהם חמשה שבועות וששה ימים לעומר",
			"היום שנים וארבעים יום שהם ששה שבועות לעומר",
			"היום שלשה וארבעים יום שהם ששה שבועות ויום אחד לעומר",
			"היום ארבעה וארבעים יום שהם ששה שבועות ושני ימים לעומר",
			"היום חמשה וארבעים יום שהם ששה שבועות ושלשה ימים לעומר",
			"היום ששה וארבעים יום שהם ששה שבועות וארבעה ימים לעומר",
			"היום שבעה וארבעים יום שהם ששה שבועות וחמשה ימים לעומר",
			"היום שמונה וארבעים יום שהם ששה שבועות וששה ימים לעומר",
			"היום תשעה וארבעים יום שהם שבעה שבועות לעומר",
		};

		//Source: http://clickit3.ort.org.il/Apps/WW/page.aspx?ws=388a6665-68ae-4113-9cbd-78c603d1dd97&page=a7d247ba-85cb-4819-8927-cc2658af2141&fol=2a2e0de8-1efe-446b-b76c-adbba35d181d&code=2a2e0de8-1efe-446b-b76c-adbba35d181d&box=99f14e8f-e0de-4907-a129-ff0740a30131&_pstate=item&_item=e6ac724c-78d8-41be-99ae-ce502c525742
		static readonly string[] omerנקוד = new[]{
			"הַיוֹם יוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם שְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם אַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם חֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁבְעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד לָעוֹמֶר",
			"הַיוֹם שְׁמוֹנָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם תִּשְׁעָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם עֲשָׂרָה יָמִים שֶׁהֵם שָׁבוּעַ אֶחָד וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם אַחַד עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁנֵים עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וַחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁלֹשָה עָשָׂר יוֹם שֶׁהֵם שָׁבוּעַ אֶחָד וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם אַרְבָּעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת לָעוֹמֶר",
			"הַיוֹם חֲמִשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם שִׁשָׁה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁבְעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁמוֹנָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם תִּשְׁעָה עָשָׂר יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם עֶשְׂרִים יוֹם שֶׁהֵם שְׁנֵי שָׁבוּעוֹת וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם אֶחָד ועֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת לָעוֹמֶר",
			"הַיוֹם שְׁנַיִם וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם שְׁלֹשָה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם אַרְבָּעָה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם חֲמִשָׁה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁשָׁה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁבְעָה וְעֶשְׂרִים יוֹם שֶׁהֵם שְׁלֹשָה שָׁבוּעוֹת וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁמוֹנָה ועֶשְׂרִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת לָעוֹמֶר",
			"הַיוֹם תִּשְׁעָה וְעֶשְׂרִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם שְׁלֹשִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם אֶחָד וּשְׁלֹשִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁנַיִם וּשְׁלֹשִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁלשָׁה וּשְׁלֹשִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם אַרְבָּעָה וּשְׁלֹשִים יוֹם שֶׁהֵם אַרְבָּעָה שָׁבוּעוֹת וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם חֲמִשָׁה וּשְׁלֹשִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת לָעוֹמֶר",
			"הַיוֹם שִׁשָׁה וּשְׁלֹשִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם שִׁבְעָה וּשְׁלֹשִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁמוֹנָה וּשְׁלֹשִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם תִּשְׁעָה וּשְׁלֹשִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם אַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם אֶחָד וְאַרְבָּעִים יוֹם שֶׁהֵם חֲמִשָׁה שָׁבוּעוֹת וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁנַיִם וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת לָעוֹמֶר",
			"הַיוֹם שְׁלֹשָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְיוֹם אֶחָד לָעוֹמֶר",
			"הַיוֹם אַרְבָּעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁנֵי יָמִים לָעוֹמֶר",
			"הַיוֹם חֲמִשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וּשְׁלֹשָה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁשָׁה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְאַרְבָּעָה יָמִים לָעוֹמֶר",
			"הַיוֹם שִׁבְעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וַחֲמִשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם שְׁמוֹנָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁשָׁה שָׁבוּעוֹת וְשִׁשָׁה יָמִים לָעוֹמֶר",
			"הַיוֹם תִּשְׁעָה וְאַרְבָּעִים יוֹם שֶׁהֵם שִׁבְעָה שָׁבוּעוֹת לָעוֹמֶר"
		};
		#endregion
	}
}
